In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Files to load
city_data_to_load = "resources/city_data.csv"
ride_data_to_load = "resources/ride_data.csv"
#to read file 
city_data_df=pd.read_csv("resources/city_data.csv")
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [3]:
ride_data_df=pd.read_csv("resources/ride_data.csv")
ride_data_df.head(10)

                 city           date   fare       ride_id
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739411e+12
1  South Michelleport   3/4/19 18:24  30.24  2.343912e+12
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005066e+12
3          Rodneyfort  2/10/19 23:22  23.44  5.149245e+12
4          South Jack    3/6/19 4:28  34.58  3.908451e+12
5        South Latoya  3/11/19 12:26   9.52  1.994999e+12
6       New Paulville  2/27/19 11:17  43.25  7.932084e+11
7        Simpsonburgh   4/26/19 0:43  35.98  1.119539e+11
8     South Karenland    1/8/19 3:28  35.09  7.995623e+12
9       North Jasmine    3/9/19 6:26  42.81  5.327642e+12

In [4]:
#get all the columns that are not null
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [5]:
#check the datatype
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [6]:
#get all the null values
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [7]:
#use unique() for the array of unique values on type columnn
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [8]:
#get the total number of city which is under urban datatype
sum(city_data_df['type']=='Urban')

66

In [9]:
sum(city_data_df['type']=='Suburban')

36

In [10]:
sum(city_data_df['type']=='Rural')

18

In [11]:
#now inspect ride data frame

In [12]:
#get column that are not null
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [13]:
#get the all null values
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [14]:
#get the data types
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [15]:
#convert the datatypes o ride_id col from float to int
#ride_data_df['ride_id']=ride_data_df['ride_id'].astype(int)
ride_data_df["ride_id"] = pd.to_numeric(ride_data_df["ride_id"], downcast='integer')

In [16]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [17]:
ride_data_df.head()

                 city           date   fare        ride_id
0  Lake Jonathanshire  1/14/19 10:14  13.83  5739410935873
1  South Michelleport   3/4/19 18:24  30.24  2343912425577
2  Port Samanthamouth   2/24/19 4:29  33.44  2005065760003
3          Rodneyfort  2/10/19 23:22  23.44  5149245426178
4          South Jack    3/6/19 4:28  34.58  3908451377344

In [18]:
#merge the data set in one dataframe
pyber_data_df=pd.merge(ride_data_df,city_data_df,how="left",on=["city","city"])
#display the dataframe
pyber_data_df.head(10)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/19 10:14,13.83,5739410935873,5,Urban
1,South Michelleport,3/4/19 18:24,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2/24/19 4:29,33.44,2005065760003,57,Urban
3,Rodneyfort,2/10/19 23:22,23.44,5149245426178,34,Urban
4,South Jack,3/6/19 4:28,34.58,3908451377344,46,Urban
5,South Latoya,3/11/19 12:26,9.52,1994999424437,10,Urban
6,New Paulville,2/27/19 11:17,43.25,793208410091,44,Urban
7,Simpsonburgh,4/26/19 0:43,35.98,111953927754,21,Urban
8,South Karenland,1/8/19 3:28,35.09,7995623208694,4,Urban
9,North Jasmine,3/9/19 6:26,42.81,5327642267789,33,Urban